### Como realizar tarefas de planilhas utilizando Python

Os dados utilizados neste exemplo são da balança comercial brasileira e podem ser acessados pelo link abaixo

<a href="http://comexstat.mdic.gov.br/pt/home">Site do MDIC</a>

In [1]:
import pandas as pd

In [15]:
br_export = pd.read_excel('br_export.xlsx', sheet_name='tab_01')

In [16]:
br_export

         Regiao      Agua   Cerveja    Sidra    Vinho
0  Centro Oeste    715981   7821007   337615   423807
1      Nordeste   1124042    254776    13548    55817
2         Norte   1051047    458848   395081    19220
3       Sudeste  13899674  60361386  2524862   363873
4           Sul   1732492  23880783  1093832  7421037

## Adição de Soma Total para linhas e colunas

In [17]:
# Adiciona coluna Total com a soma  total de cada região

br_export['Total (US$)'] = br_export.sum(axis=1)

# Reseta o index

br_export = br_export.set_index('Regiao')

# Adiciona linha com a soma total dos produtos

br_export = br_export.append(br_export.sum(numeric_only=True).rename('Total (US$)'))

In [18]:
# vamos vizualizar a nova tabela com os totais para linhas e colunas

br_export

                  Agua   Cerveja    Sidra    Vinho  Total (US$)
Regiao
Centro Oeste    715981   7821007   337615   423807      9298410
Nordeste       1124042    254776    13548    55817      1448183
Norte          1051047    458848   395081    19220      1924196
Sudeste       13899674  60361386  2524862   363873     77149795
Sul            1732492  23880783  1093832  7421037     34128144
Total (US$)   18523236  92776800  4364938  8283754    123948728

In [ ]:
# Formatar os valores como moeda para ficar mais legível

from babel.numbers import format_currency

br_export[br_export.columns[0:]] = br_export[br_export.columns[0:]].applymap(
lambda x: format_currency(x, 'USD', locale='en_US'),)

In [ ]:
# Tabela finalizada com valores em formato monetário

br_export

In [19]:
# gerar formato do jupyter notebook

from babel.numbers import format_currency

br_export = br_export.style.format(
lambda x: format_currency(x, 'USD', locale='en_US'),
subset=['Agua', 'Cerveja', 'Sidra', 'Vinho', 'Total (US$)'],
)

In [20]:
br_export